duxinglang-1/nRF9160_test/E2_V3_NCS2.3.0_RES_TEST/src/communicate/communicate.c
	//mcu fw version
	strcat(reply, g_fw_version);	
	strcat(reply, ",");

	//modem fw version
	strcat(reply, &g_modem[12]);	
	strcat(reply, ",");

	//ppg algo
#ifdef CONFIG_PPG_SUPPORT	
	strcat(reply, g_ppg_ver);
#else
	strcat(reply, "NO PPG");
#endif
	strcat(reply, ",");

	//wifi version
#ifdef CONFIG_WIFI_SUPPORT
	strcat(reply, g_wifi_ver);
#else
	strcat(reply, "NO WiFi");
#endif
	strcat(reply, ",");

	//wifi mac
#ifdef CONFIG_WIFI_SUPPORT	
	strcat(reply, g_wifi_mac_addr);
#else
	strcat(reply, "NO WiFi");
#endif
	strcat(reply, ",");

	//ble version
#ifdef CONFIG_BLE_SUPPORT	
	strcat(reply, &g_nrf52810_ver[15]);
#else
	strcat(reply, "NO BLE");
#endif
	strcat(reply, ",");

	//ble mac
#ifdef CONFIG_BLE_SUPPORT	
	strcat(reply, g_ble_mac_addr);
#else
	strcat(reply, "NO BLE");
#endif

	NBSendPowerOnInfor(reply, strlen(reply));
}

/*****************************************************************************
 * FUNCTION
 *  SendPowerOffData
 * DESCRIPTION
 *  发送关机数据包
 * PARAMETERS
 *	pwroff_mode			[IN]		关机模式 1:低电关机 2:按键关机 3:重启关机 
 * RETURNS
 *  Nothing
 *****************************************************************************/
void SendPowerOffData(uint8_t pwroff_mode)
{
	uint8_t tmpbuf[10] = {0};
	uint8_t reply[128] = {0};

	//pwr off mode
	sprintf(reply, "%d,", pwroff_mode);
	
	//nb rsrp
	sprintf(tmpbuf, "%d,", g_rsrp);
	strcat(reply, tmpbuf);
	
	//battery
	GetBatterySocString(tmpbuf);
	strcat(reply, tmpbuf);
			
	NBSendPowerOffInfor(reply, strlen(reply));
}

/*****************************************************************************
 * FUNCTION
 *  SendSettingsData
 * DESCRIPTION
 *  发送终端设置项数据包
 * PARAMETERS
 *	Nothing
 * RETURNS
 *  Nothing
 *****************************************************************************/
void SendSettingsData(void)
{
	uint8_t tmpbuf[10] = {0};
	uint8_t reply[128] = {0};

	//temp uint
	sprintf(reply, "%d,", global_settings.temp_unit);
	
	//language
	switch(global_settings.language)
	{
#ifndef FW_FOR_CN
  #ifdef LANGUAGE_EN_ENABLE
	case LANGUAGE_EN:	//English
		strcat(reply, "en");
		break;
  #endif
  #ifdef LANGUAGE_DE_ENABLE
	case LANGUAGE_DE:	//Deutsch
		strcat(reply, "de");
		break;
  #endif
  #ifdef LANGUAGE_FR_ENABLE
	case LANGUAGE_FR:	//French
		strcat(reply, "fr");
		break;
  #endif
  #ifdef LANGUAGE_IT_ENABLE
	case LANGUAGE_IT:	//Italian
		strcat(reply, "it");
		break;
  #endif
  #ifdef LANGUAGE_ES_ENABLE
	case LANGUAGE_ES:	//Spanish
		strcat(reply, "es");
		break;
  #endif
  #ifdef LANGUAGE_PT_ENABLE
	case LANGUAGE_PT:	//Portuguese
		strcat(reply, "pt");
		break;
  #endif
  #ifdef LANGUAGE_JA_ENABLE
	case LANGUAGE_JA:	//Japanese
		strcat(reply, "ja");
		break;
  #endif
  #ifdef LANGUAGE_RU_ENABLE
	case LANGUAGE_RU:	//Russian
		strcat(reply, "ru");
		break;
  #endif
  #ifdef LANGUAGE_SV_ENABLE
	case LANGUAGE_SV:	//Swedish
		strcat(reply, "sv");
		break;
  #endif
  #ifdef LANGUAGE_PL_ENABLE
	case LANGUAGE_PL:	//Polish
		strcat(reply, "pl");
		break;
  #endif
  #ifdef LANGUAGE_GR_ENABLE
	case LANGUAGE_GR:	//Greece
		strcat(reply, "el");
		break;
  #endif
  #ifdef LANGUAGE_AR_ENABLE
	case LANGUAGE_AR:	//Arabic
		strcat(reply, "ar");
		break;
  #endif
  #ifdef LANGUAGE_KR_ENABLE
	case LANGUAGE_KR:	//Korea	
		strcat(reply, "ko");
		break;
  #endif
  #ifdef LANGUAGE_DK_ENABLE
	case LANGUAGE_DK:	//Danish
		strcat(reply, "da");
		break;
  #endif
  #ifdef LANGUAGE_FI_ENABLE
	case LANGUAGE_FI:	//Finnish
		strcat(reply, "fi");
		break;
  #endif
  #ifdef LANGUAGE_NL_ENABLE
	case LANGUAGE_NL:	//Dutch
		strcat(reply, "nl");
		break;
  #endif
  #ifdef LANGUAGE_NO_ENABLE
	case LANGUAGE_NO:	//Norwegian
		strcat(reply, "no");
		break;
  #endif
#else
  #ifdef LANGUAGE_CN_ENABLE
	case LANGUAGE_CN:	//Chinese
		strcat(reply, "zh");
		break;
  #endif
  #ifdef LANGUAGE_EN_ENABLE
	case LANGUAGE_EN:	//English
		strcat(reply, "en");
		break;
  #endif
#endif	
	}

	sprintf(tmpbuf, ",%d", global_settings.time_format);
	strcat(reply, tmpbuf);
	
	NBSendSettingsData(reply, strlen(reply));
}

/*****************************************************************************
 * FUNCTION
 *  SendSosAlarmData
 * DESCRIPTION
 *  发送SOS报警包(无地址信息)
 * PARAMETERS
 *	
 * RETURNS
 *  Nothing
 *****************************************************************************/
void SendSosAlarmData(void)
{
	uint8_t reply[8] = {0};
	uint32_t i,count=1;

	strcpy(reply, "1");
	NBSendAlarmData(reply, strlen(reply));
}

/*****************************************************************************
 * FUNCTION
 *  SendFallAlarmData
 * DESCRIPTION
 *  发送Fall报警包(无地址信息)
 * PARAMETERS
 *	
 * RETURNS
 *  Nothing
 *****************************************************************************/
void SendFallAlarmData(void)
{
	uint8_t reply[8] = {0};
	uint32_t i,count=1;

	strcpy(reply, "2");
	NBSendAlarmData(reply, strlen(reply));
}

